---
kind: method
id: M:Autodesk.Revit.DB.ModelCurveArray.#ctor
source: html/0e119a28-79c1-a541-bc47-0ed83eb99991.htm
---
# Autodesk.Revit.DB.ModelCurveArray.#ctor Method

Initializes a new instance of the ModelCurveArray class

## Syntax (C#)
```csharp
public ModelCurveArray()
```